import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> quran = [
  ItemModel(
    title: "الفاتحة",
    core: "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ   ﴿١﴾   الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ   ﴿٢﴾   الرَّحْمَٰنِ الرَّحِيمِ   ﴿٣﴾   مَالِكِ يَوْمِ الدِّينِ   ﴿٤﴾   إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ   ﴿٥﴾   اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ   ﴿٦﴾   صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ   ﴿٧﴾",
    hint: "",
  ),
  ItemModel(
    title: "البقرة",
    core: "... رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ   ﴿١٢٧﴾",
    hint: "",
  ),
  ItemModel(
    title: "البقرة",
    core: "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا ۖ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ   ﴿١٢٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "البقرة",
    core: "... رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ   ﴿٢٠١﴾",
    hint: "",
  ),
  ItemModel(
    title: "البقرة",
    core: "... سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ   ﴿٢٨٥﴾",
    hint: "",
  ),
  ItemModel(
    title: "البقرة",
    core: "... رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ   ﴿٢٨٦﴾",
    hint: "",
  ),
  ItemModel(
    title: "آل عمران",
    core: "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ   ﴿٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "آل عمران",
    core: "... رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ   ﴿١٦﴾",
    hint: "",
  ),
  ItemModel(
    title: "آل عمران",
    core: "... رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ   ﴿٣٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "آل عمران",
    core: "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ   ﴿٥٣﴾",
    hint: "",
  ),
  ItemModel(
    title: "آل عمران",
    core: "... رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ   ﴿١٤٧﴾",
    hint: "",
  ),
  ItemModel(
    title: "آل عمران",
    core: "... رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ   ﴿١٩١﴾   رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ ۖ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ   ﴿١٩٢﴾   رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ   ﴿١٩٣﴾   رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ   ﴿١٩٤﴾",
    hint: "",
  ),
  ItemModel(
    title: "المائدة",
    core: "... رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ   ﴿٨٣﴾",
    hint: "",
  ),
  ItemModel(
    title: "الأعراف",
    core: "... رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ   ﴿٢٣﴾",
    hint: "",
  ),
  ItemModel(
    title: "الأعراف",
    core: "... رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ   ﴿٤٧﴾",
    hint: "",
  ),
  ItemModel(
    title: "الأعراف",
    core: "... أَنتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنتَ خَيْرُ الْغَافِرِينَ   ﴿١٥٥﴾   وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ ...   ﴿١٥٦﴾",
    hint: "",
  ),
  ItemModel(
    title: "التوبة",
    core: "... حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ   ﴿١٢٩﴾",
    hint: "",
  ),
  ItemModel(
    title: "يونس",
    core: "... رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ   ﴿٨٥﴾   وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ   ﴿٨٦﴾",
    hint: "",
  ),
  ItemModel(
    title: "هود",
    core: "... رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ   ﴿٤٧﴾",
    hint: "",
  ),
  ItemModel(
    title: "يوسف",
    core: "رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ   ﴿١٠١﴾",
    hint: "",
  ),
  ItemModel(
    title: "ابراهيم",
    core: "... رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الْأَصْنَامَ   ﴿٣٥﴾",
    hint: "",
  ),
  ItemModel(
    title: "ابراهيم",
    core: "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ   ﴿٤٠﴾   رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ   ﴿٤١﴾",
    hint: "",
  ),
  ItemModel(
    title: "الكهف",
    core: "... رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا   ﴿١٠﴾",
    hint: "",
  ),
  ItemModel(
    title: "طه",
    core: "... رَبِّ اشْرَحْ لِي صَدْرِي   ﴿٢٥﴾   وَيَسِّرْ لِي أَمْرِي   ﴿٢٦﴾   وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي   ﴿٢٧﴾   يَفْقَهُوا قَوْلِي   ﴿٢٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "الأنبياء",
    core: "... لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ   ﴿٨٧﴾",
    hint: "",
  ),
  ItemModel(
    title: "الأنبياء",
    core: "... رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ   ﴿٨٩﴾",
    hint: "",
  ),
  ItemModel(
    title: "المؤمنون",
    core: "... رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ   ﴿٩٧﴾   وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ   ﴿٩٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "المؤمنون",
    core: "... رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ   ﴿١٠٩﴾",
    hint: "",
  ),
  ItemModel(
    title: "المؤمنون",
    core: "... رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ   ﴿١١٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "الفرقان",
    core: "... رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا   ﴿٦٥﴾   إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا   ﴿٦٦﴾",
    hint: "",
  ),
  ItemModel(
    title: "الفرقان",
    core: "... رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا   ﴿٧٤﴾",
    hint: "",
  ),
  ItemModel(
    title: "الشعراء",
    core: "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ   ﴿٨٣﴾   وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ   ﴿٨٤﴾   وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ   ﴿٨٥﴾   وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ   ﴿٨٦﴾   وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ   ﴿٨٧﴾   يَوْمَ لَا يَنفَعُ مَالٌ وَلَا بَنُونَ   ﴿٨٨﴾   إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ   ﴿٨٩﴾",
    hint: "",
  ),
  ItemModel(
    title: "النمل",
    core: "... رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ   ﴿١٩﴾",
    hint: "",
  ),
  ItemModel(
    title: "القصقص",
    core: "... رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي ...   ﴿١٦﴾",
    hint: "",
  ),
  ItemModel(
    title: "القصقص",
    core: "... رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ   ﴿٢١﴾",
    hint: "",
  ),
  ItemModel(
    title: "القصقص",
    core: "... عَسَىٰ رَبِّي أَن يَهْدِيَنِي سَوَاءَ السَّبِيلِ   ﴿٢٢﴾",
    hint: "",
  ),
  ItemModel(
    title: "القصقص",
    core: "... رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ   ﴿٢٤﴾",
    hint: "",
  ),
  ItemModel(
    title: "العنكبوت",
    core: "... رَبِّ انصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ   ﴿٣٠﴾",
    hint: "",
  ),
  ItemModel(
    title: "الصافات",
    core: "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ   ﴿١٠٠﴾",
    hint: "",
  ),
  ItemModel(
    title: "الأحقاف",
    core: "... رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ   ﴿١٥﴾",
    hint: "",
  ),
  ItemModel(
    title: "الحشر",
    core: "... رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ   ﴿١٠﴾",
    hint: "",
  ),
  ItemModel(
    title: "الممتحنة",
    core: "... رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ   ﴿٤﴾   رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ   ﴿٥﴾",
    hint: "",
  ),
  ItemModel(
    title: "التحريم",
    core: "... رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ   ﴿٨﴾",
    hint: "",
  ),
  ItemModel(
    title: "نوح",
    core: "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا   ﴿٢٨﴾",
    hint: "",
  ),
];
