import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> problems = [
  ItemModel(
    title: "دُعَاءُ الْهَمِّ وَالْحُزْنِ",
    core: "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْهَمِّ وَالْحُزْنِ",
    core: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْكَرْبِ",
    core: "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْكَرْبِ",
    core: "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْكَرْبِ",
    core: "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْكَرْبِ",
    core: "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ لِقَاءِ الْعَدُوِّ وَذِي السُّلْطَانِ",
    core: "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ لِقَاءِ الْعَدُوِّ وَذِي السُّلْطَانِ",
    core: "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ لِقَاءِ الْعَدُوِّ وَذِي السُّلْطَانِ",
    core: "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ خَافَ ظُلْمَ السُّلْطَانِ",
    core: "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ خَافَ ظُلْمَ السُّلْطَانِ",
    core: "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عَلَى الْعَدُوِّ",
    core: "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ مَنْ خَافَ قَوْماً",
    core: "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ أَصَابَهُ وَسْوَسَةٌ فِي الإِيمَانِ",
    core: "يَسْتَعِيْذُ بِاللهِ ويَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ أَصَابَهُ وَسْوَسَةٌ فِي الإِيمَانِ",
    core: "آمَنْتُ بِاللهِ وَرُسُلِهِ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ أَصَابَهُ وَسْوَسَةٌ فِي الإِيمَانِ",
    core: "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ",
    hint: "سورة الحديد الآية 3.",
  ),
  ItemModel(
    title: "دُعَاءُ مَنِ اسْتَصْعَبَ عَلَيْهِ أَمْرٌ",
    core: "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ وَيَفْعَلُ مَنْ أَذْنَبَ ذَنْباً",
    core: "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ طَرْدِ الشَّيطَانِ وَوَسَاوِسِهِ",
    core: "الاسْتِعَاذَةُ بِاللهِ مِنْهُ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ طَرْدِ الشَّيطَانِ وَوَسَاوِسِه",
    core: "الأذَانُ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ طَرْدِ الشَّيطَانِ وَوَسَاوِسِه",
    core: "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
    hint: "لا تجعلو بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة",
  ),
  ItemModel(
    title: "الدُّعَاءُ حِينَمَا يَقَعُ مَا لاَ يَرْضَاهُ أَوْ غُلِبَ عَلَى أَمْرِهِ",
    core: "قَدَرُ اللهِ وَما شَاءَ فَعَلَ.",
    hint: "المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كلٍّ خير، احرص على ما ينفعك، واستعن بالله ولا تعجِز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل؛ فإن لو تفتح عمل الشيطان",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلْمَرِيضِ فِي عِيَادَتِهِ",
    core: "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلْمَرِيضِ فِي عِيَادَتِه",
    core: "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ.",
    hint: "سبع مرات",
  ),
  ItemModel(
    title: "فَضْلُ عِيَادَةِ المَرِيضِ",
    core: "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ المَرِيضِ الَّذِي يَئِسَ مِنْ حَيَاتِهِ",
    core: "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ المَرِيضِ الَّذِي يَئِسَ مِنْ حَيَاتِهِ",
    core: "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ المَرِيضِ الَّذِي يَئِسَ مِنْ حَيَاتِهِ",
    core: "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ.",
    hint: "",
  ),
  ItemModel(
    title: "تَلْقِينُ المُحْتَضَرِ",
    core: "لَا إلَهَ إلَّا اللهُ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَن أُصِيبَ بِمُصِيبَةٍ",
    core: "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ إِغْمَاضِ المَيِّتِ",
    core: "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلمَيِّتِ فِي الصَّلاَةِ عَلَيْهِ:",
    core: "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ [وَ عَذَابِ النَّارِ].",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلمَيِّتِ فِي الصَّلاَةِ عَلَيْهِ",
    core: "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلمَيِّتِ فِي الصَّلاَةِ عَلَيْهِ",
    core: "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلمَيِّتِ فِي الصَّلاَةِ عَلَيْهِ",
    core: "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلْفَرَطِ فِي الصَّلاةِ عَلَيْهِ",
    core: "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلْفَرَطِ فِي الصَّلاةِ عَلَيْهِ",
    core: "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ التَّعْزِيَةِ",
    core: "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ إِدْخَالِ الميِّتِ الْقَبْرَ",
    core: "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ بَعْدَ دَفْنِ المَيِّتِ",
    core: "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
    hint: "كان النبي صلي الله عليه وسلم إذا فرغ من دفن الميت وقف عليه، وقال: استغفروا لأخيكم، وسلوا له التثبيت، فإنه الآن يسأل",
  ),
  ItemModel(
    title: "دُعَاءُ زِيَارَةِ الْقُبُورِ",
    core: "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الغَضَبِ",
    core: "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ رَأَى مُبْتَلَىً",
    core: "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْخَوْفِ مِنَ الشِّرْكِ",
    core: "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ كَرَاهِيَةِ الطِّيَرَةِ",
    core: "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَفْعَلُ وَيَقُولُ مَنْ أَحَسَّ وَجَعاً فِي جَسَدِهِ",
    core: "ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ، وَقُلْ بِاسْمِ اللهِ ثَلَاثًا، وَقُلْ سَبْعَ مَرَّاتٍ أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يُقَالُ عِنْدَ الْفَزَعِ",
    core: "لَا إلَهَ إلَّا اللهُ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ لِرَدِّ كَيْدِ مَرَدَةِ الشَّيَاطِينِ",
    core: "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ.",
    hint: "",
  ),

];
