import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> mosque = [
  ItemModel(
    title: "دُعَاءُ الذَّهابِ إِلَى المَسْجِدِ",
    core: "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ دُخُولِ المَسْجِدِ",
    core: "أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ. \n"
        "[بِسْمِ اللَّهِ, وَالصَّلاةُ]. \n"
        "[وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ]. \n"
        "[اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ]."
    ,
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ",
    core: "بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ",
    hint: "",
  ),
  ItemModel(
    title: "أذكَارُ الأذَانِ",
    core: "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي (حَيَّ عَلَى الصَّلاةِ) وَ (حَيَّ عَلَى الفَلاحِ) فَيَقُولُ: لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ",
    hint: "",
  ),
  ItemModel(
    title: "أذكَارُ الأذَانِ",
    core: "عَقِبَ تَشَهُّدِ المُؤَذِّنِ يَقُولُ: \n"
        "وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَ حْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا."
    ,
    hint: "",
  ),
  ItemModel(
    title: "أذكَارُ الأذَانِ",
    core: "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
    hint: "",
  ),
  ItemModel(
    title: "أذكَارُ الأذَانِ",
    core: "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاةِ القَائِمَةِ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ].",
    hint: "",
  ),
  ItemModel(
    title: "أذكَارُ الأذَانِ",
    core: "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ، فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
    hint: "",
  ),
];
