import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> other = [
  ItemModel(
    title: "دُعَاءُ لُبْسِ الثَّوبِ",
    core: "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ لُبْسِ الثَّوْبِ الجَدِيدِ",
    core: "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعاءُ لِمَنْ لَبِسَ ثوباً جَدِيداً",
    core: "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعاءُ لِمَنْ لَبِسَ ثوباً جَدِيداً",
    core: "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ إِذَا وَضَعَ ثَوْبَهُ",
    core: "بِسْمِ اللهِ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ قَضَاءِ الدَّيْنِ",
    core: "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ قَضَاءِ الدَّيْنِ",
    core: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال.",
    hint: "",
  ),
  ItemModel(
    title: "تَهْنِئَةُ المَوْلُودِ لَهُ وَجَوَابُهُ",
    core: "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُ. \n"
        "وَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ."
    ,
    hint: "",
  ),
  ItemModel(
    title: "ما يُعوَّذُ بِهِ الأَوْلاَدُ",
    core: "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ.",
    hint: "كان رسول الله صلي الله عليه وسلم يعوذ الحسن والحسين",
  ),
  ItemModel(
    title: "مِنْ أَدْعِيَةِ الاسْتِصْحَاءِ",
    core: "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الْعُطَاسِ",
    core: "إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلْ : الْحَمْدُ لِلَّهِ ، وَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ : يَرْحَمُكَ اللَّهُ ، فَإِذَا قَالَ لَهُ يَرْحَمُكَ اللَّهُ فَلْيَقُلْ : يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يُقَالُ لِلْكَافِرِ إِذَا عَطَسَ فَحَمِدَ اللهَ",
    core: "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِلْمُتَزَوِّجِ",
    core: "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ المُتَزَوِّجِ وَشِرَاءِ الدَّابَّةِ",
    core: "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ قَبـلَ إِتْيَانِ الزَّوْجَةِ",
    core: "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يُقَالُ فِي المَجْلِسِ",
    core: "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ.",
    hint: "",
  ),
  ItemModel(
    title: "كَفَّارَةُ المَجْلِسِ",
    core: "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الرُّكُوبِ",
    core: "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴿سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴾ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ.",
    hint: "",
  ),
  ItemModel(
    title: "دُعاءُ دُخُولِ السُّوقِ",
    core: "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ مَنْ أَتَاهُ أمْرٌ يَسُرُّهُ أَوْ يَكْرَهُهُ",
    core: "كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ الْأَمْرُ يَسُرُّهُ، قَالَ: الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ. \n"
        "وَإِذَا أَتَاهُ الْأَمْرُ يَكْرَهُهُ، قَالَ: الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ."
    ,
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ لِمَنْ سَبَبْتَهُ",
    core: "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ المُسْلِمُ إِذَا مَدَحَ المُسْلِمَ",
    core: "قَالَ ﷺ: إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ المُسْلِمُ إِذَا زُكِّيَ",
    core: "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ].",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَفْعَلُ مَنْ أَتَاهُ أَمْرٌ يَسُرُّهُ",
    core: "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ مَنْ خَشِيَ أَنْ يُصِيبَ شَيْئاً بِعَيْنِهِ",
    core: "إذَا رَأى أحَدُكُمْ مِنْ أخِيِهِ، أوْ مِنْ نَفْسِهِ، أوْ مِنْ مَالِهِ مَا يُعْجِبُهُ [فَلْيَدْعُ لَهُ بالبَرَكَةِ] فَإنَّ العَيْنَ حَقٌّ.",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ عِنْدَ الذَّبْحِ أَوِ النَّحْرِ",
    core: "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ صَلاَةِ الاسْتِخَارَةِ",
    core: "عَنْ جَابِرِ بْنِ عَبْد ِاللَّهِ رَضِي اللَّهم عَنْهمَا قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهم عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا الِاسْتِخَارَةَ فِي الْأُمُورِ كُلِّهَا كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ ثُمَّ لِيَقُلِ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ عَاجِلِ أَمْرِي وَآجِلِهِ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي قَالَ وَيُسَمِّي حَاجَتَهُ.",
    hint: "",
  ),
];
