import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> eating = [
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ إِفْطَارِ الصَّائِمِ",
    core: "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ إِفْطَارِ الصَّائِمِ",
    core: "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ قَبْلَ الطَّعَامِ",
    core: "إِذَا أَكَلَ أَحَدُكُمْ فَلْيَذْكُرِ اسْمَ اللَّهِ تَعَالَى، فَإِنْ نَسِيَ أَنْ يَذْكُرَ اسْمَ اللَّهِ تَعَالَى فِي أَوَّلِهِ فَلْيَقُلْ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ قَبْلَ الطَّعَامِ",
    core: "مَنْ أطْعَمَهُ اللهُ الطَّعَامَ؛ فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَنـَا فِيْهِ، وأطْعِمْنَا خَيْراً مِنْهُ، ومَنْ سَقَاهُ اللهُ لَبَناً فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَـنَا فِيْهِ، وَزِدْنَا مِنْهُ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ الْفَرَاغِ مِنَ الطَّعَامِ",
    core: "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ الْفَرَاغِ مِنَ الطَّعَامِ",
    core: "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا.",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الضَّيْفِ لِصَاحِبِ الطَّعَامِ",
    core: "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ.",
    hint: "",
  ),
  ItemModel(
    title: "التَّعْرِيضُ بِالدُّعَاءِ لِطَلَبِ الطَّعَامِ أَوِ الشَّرَابِ",
    core: "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ إِذَا أَفْطَرَ عِنْدَ أَهْلِ بَيْتٍ",
    core: "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الصَّائِمِ إِذَا حَضَرَ الطَّعَامُ وَلَمْ يُفْطِرْ",
    core: "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ",
    hint: "",
  ),
  ItemModel(
    title: "مَا يَقُولُ الصَّائِمُ إِذَا سَابَّهُ أَحَدٌ",
    core: "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ رُؤْيَةِ بَاكُورَةِ الثَّمَرِ",
    core: "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا.",
    hint: "",
  ),

];
