import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> wakingUp = [
  ItemModel(
    title: "أذكار الإستيقاظ من النوم",
    core: "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور",
    hint: "",
  ),
  ItemModel(
    title: "أذكار الإستيقاظ من النوم",
    core: "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه",
    hint: "",
  ),
  ItemModel(
    title: "أذكار الإستيقاظ من النوم",
    core: "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد، وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ، ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي",
    hint: "من قال ذلك غفر له، فان دعا استجيب له، فان قام فتوضأ ثم صلي قبلت صلاته",
  ),
];