import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> sleep = [
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "يجمع كفيه ثم ينفث فيهما والقراءة فيهما‏:‏ ‏{‏قل هو الله أحد‏}‏ و‏{‏قل أعوذ برب الفلق‏}‏ و‏{‏قل أعوذ برب الناس‏}‏ ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده",
    hint: "ثلاث مرات",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    hint: "من قرأها إذا أوي إلي فراشة فإنه لن يزال عليه من الله حافظ ولا يقربخ شيطان حتى يصبح",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    hint: "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين",
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة",
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك",
    hint: "ثلاث مرات",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا",
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "سُبْحَانَ اللهِ [ثلاثا وثلاثين]\n "
        "وَالحَمْدُ لِلَّهِ [ثلاثا وثلاثين]\n"
        "وَاللهُ أكْبرُ [أربعا وثلاثين]\n"
    ,
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ.",
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْمِ",
    core: "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ.",
    hint: " ",
  ),
  ItemModel(
    title: "أَذْكَارُ النَّوْم",
    core: "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت",
    hint: " ",
  ),
  ItemModel(
    title: "الدُّعَاءُ إذَا تَقَلَّبَ لَيْلاً",
    core: "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
    hint: " ",
  ),
  ItemModel(
    title: "دُعَاءُ الْفَزَعِ فِي النَّوْمِ وَمَنْ بُلِيَ بِالْوِحْشَةِ",
    core: "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
    hint: " ",
  ),
  ItemModel(
    title: "مَا يَفْعَـــلُ مَنْ رَأَى الرُّؤْيَا أَوِ الْحُلْمَ",
    core:" يَنْفُثُ عَن يَسَارِهِ [ثلاثا]. \n"
        "يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى [ثلاثا].\n"
        "لَا يُحَدِّثُ بِهَا أحَداً.\n"
        "يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ."
    ,
    hint: " ",
  ),
  ItemModel(
    title: "مَا يَفْعَـــلُ مَنْ رَأَى الرُّؤْيَا أَوِ الْحُلْم",
    core: "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
    hint: " ",
  ),


];
