import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> nature = [
  ItemModel(
    title: "دُعَاءُ الرِّيحِ",
    core: "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الرِّيحِ",
    core: "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الرَّعْدِ",
    core: "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
    hint: "",
  ),
  ItemModel(
    title: "مِنْ أَدْعِيَةِ الاسْتِسْقَاءِ",
    core: "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
    hint: "",
  ),
  ItemModel(
    title: "مِنْ أَدْعِيَةِ الاسْتِسْقَاءِ",
    core: "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
    hint: "",
  ),
  ItemModel(
    title: "مِنْ أَدْعِيَةِ الاسْتِسْقَاءِ",
    core: "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ إِذَا رَأَى المَطَرَ",
    core: "اللَّهُمَّ صَيِّباً نَافِعاً",
    hint: "",
  ),
  ItemModel(
    title: "الذِّكْرُ بَعْدَ نُزُولِ المَطَرِ",
    core: "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ رُؤيَةِ الهِلالِ",
    core: "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعاءُ عِنْدَ سَمَاعِ صِياحِ الدِّيكِ ونَهِيقِ الْحِمَارِ",
    core: "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا.",
    hint: "",
  ),
  ItemModel(
    title: "الدُّعَاءُ عِنْدَ سَـمَاعِ نُبَاحِ الْكِلاَبِ بِاللَّيْلِ",
    core: "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ.",
    hint: "",
  ),

];
