import 'package:azkar_of_the_muslim/models/akar_item_model.dart';

List<ItemModel> home = [
  ItemModel(
    title: "دُعَاءُ دُخُولِ الخَلاءِ",
    core:"بِسْمِ اللهِ\n"
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ."
    ,
    hint: "",
  ),
  ItemModel(
    title: "دُعَاءُ الخُرُوجِ مِنَ الخَلاءِ",
    core: "غُفْرَانَكَ.",
    hint: "",
  ),
  ItemModel(
    title: "الذِّكْرُ عِنْدَ الخُرُوجِ مِنَ الْمَنْزِلِ",
    core: "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ.",
    hint: "",
  ),
  ItemModel(
    title: "الذِّكْرُ عِنْدَ الخُرُوجِ مِنَ الْمَنْزِلِ",
    core: "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ.",
    hint: "",
  ),
  ItemModel(
    title: "الذِّكْرُ عِندَ دُخُولِ المَنْزِلِ",
    core: "إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ، وَعِنْدَ طَعَامِهِ، قَالَ الشَّيْطَانُ: لَا مَبِيتَ لَكُمْ وَلَا عَشَاءَ. وَإِذَا دَخَلَ فَلَمْ يُذْكَرِ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ: أَدْرَكْتُمُ الْمَبِيتَ. فَإِذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ قَالَ: أَدْرَكْتُمُ الْمَبِيتَ وَالْعَشَاءَ.",
    hint: "",
  ),
  
];
